# Get data

```SQL

SELECT title FROM movies;

SELECT title,genre FROM movies;

SELECT * FROM movies;

SELECT title FROM movies WHERE  id = 2;

SELECT * FROM movies WHERE title = 'Kill Bill';

SELECT title FROM movies ORDER BY duration DESC;

SELECT * FROM movies WHERE duration > 100;

SELECT title FROM movies WHERE id = 1 AND genre = 'Comedy';

SELECT title FROM movies WHERE id = 1 OR genre = 'Comedy';

```

# Add data

```SQL
INSERT INTO movies (id, title, genre, duration) VALUES (5,'The Circus', 'Comedy', 71);

INSERT INTO movies VALUES (5,'The Circus', 'Comedy', 71);

INSERT INTO movies (title, duration) VALUES ('The Fly', 80);
```

# Update data

```SQL
UPDATE movies SET genre = 'Romance' WHERE id = 2;

UPDATE movies SET genre = 'Romance', duration = 70 WHERE id = 2;

UPDATE movies SET genre = 'Romance', duration = 70 WHERE id = 2 OR id = 4;
```

# Remove data

```SQL
DELETE FROM movies WHERE id = 2;

DELETE FROM movies WHERE duration > 200;

```


# Drop a database

```SQL
DROP DATABASE movies;
DROP TABLE movies;
```

# Create a database

```SQL
CREATE DATABASE lucas_movies;

CREATE TABLE movies
(id int,
 title varchar(50),
 genre varchar(15),
 duration int
 )
```

# Add/remove a column

```SQL
ALTER TABLE movies
ADD COLUMN ratings int;



ALTER TABLE movies
DROP COLUMN ratings;
```